module.exports.config = {
	name: "👉👌",
    version: "1.0.1",
    permission: 0,
    credits: "BADOL-KHAN",
    prefix: true,
    description: "ask any thing",
    category: "admin",
    usages: "",
    cooldowns: 5,
    dependencies: {
        "openai": ""
    }
};

module.exports.run = async function({ api, args, Users, event}) {
    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("বস কোন মাগী কে চুদতে হবে তুমি শুধু ১ বার @ম্যানশন করো", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("মুরগি খানকি মাগী তোর 𝐁𝐀𝐃𝐎𝐋 𝐀𝐛𝐛𝐮 এর চুদা লো");
setTimeout(() => {a({body: "খাংকি মাগী তরে চুদি  𝐁𝐀𝐃𝐎𝐋 𝐁𝐨𝐭 🥰।" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "খাংকি মাগী তর কচি বোন রে আমি  চুদি  😍.." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "বেশ্যা মাগী তর পম পম দিয়া ক্রিকেট খেলমু খাংকি মাগী আমি তোর বাপ 🐰" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "খাংকি মাগী তর কচি  ভোদায় কামর দিমু 𝐈 𝐀𝐦 তোর আব্বু 𝐁𝐀𝐃𝐎𝐋💔!" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "খাংকি মাগী  কথা ক কম তর রে চুদে বানামু আইটেম বম " + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "𝐃𝐞𝐩𝐫𝐞𝐬𝐬𝐢𝐨𝐧 এ থেকেও তরে চু*** দি 🤬 " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "তর আম্মু রে আচার এর লোভ দেখিয়ে চুদি মাগী 🤬" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "বান্দি মাগী তর কচি  ভোদা ফাক কর থুতু দিয়ে তর ভোদায় আমার ধন ডুকামু 🤟" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "বান্দি মাগী তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফালাইয়া 𝐏𝐨𝐰𝐞𝐫 𝐎𝐅 𝐁𝐀𝐃𝐎𝐋 𝐁𝐨𝐓🤝" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "উফফফ খাদ্দামা মাগি তর কালা ভোদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো  💉।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "অনলাইনে পতিতা হয়ে গেছত মাগী এমন চুদা দিমু লাইফ টাইম মনে রাখবি 𝐁𝐀𝐃𝐎𝐋 তর বাপ মাগী 😘।" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "মাগি শোন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভোদা আর চুদলাম না তোর বোন এর পায়েজামা টা খুলে দে  ✋" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: " হাই হাত মারা মাগী তর বেশ্যা জাতের মায়েরে আদর করে চুদি " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("~ চুদা কি আরো খাবি হাত মারা মাগী 🤖")} , 39000);
setTimeout(() => {a({body: "খাংকি মাগী 🥰।" + " " + name, mentions: arraytag})}, 42000);
setTimeout(() => {a({body: "বেশ্যা মাগী 😍.." + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "হাত মারা মাগী🐰" + " " + name, mentions: arraytag})}, 51000);
setTimeout(() => {a({body: "পতিতা মাগী 💔!" + " " + name, mentions: arraytag})}, 54000);
setTimeout(() => {a({body: "তোর কালা ভোদায় থু..... " + " " + name, mentions: arraytag})}, 57000);
setTimeout(() => {a({body: "𝐃𝐞𝐩𝐫𝐞𝐬𝐬𝐢𝐨𝐧 এ থেকেও তরে চু*** দি 🤬 " + " " + name, mentions: arraytag})}, 59400);
setTimeout(() => {a({body: "তোর মায়েরে চুদি" + " " + name, mentions: arraytag})}, 63000);
setTimeout(() => {a({body: "লেডি বক্সের পতিতা মাগী🤟" + " " + name, mentions: arraytag})}, 66000);
setTimeout(() => {a({body: "তর বোন রে পায়জামা খুলে চুদি 🤣" + " " + name, mentions: arraytag})},69000);
setTimeout(() => {a({body: "উম্মম্মা তর বোন এর কচি ভোদায়💉।" + " " + name, mentions: arraytag})}, 72000);
setTimeout(() => {a({body: "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।" + " " + name, mentions: arraytag})}, 75000);
setTimeout(() => {a({body: "বেশ্যা মাগী  ✋" + " " + name, mentions: arraytag})},81000);
setTimeout(() => {a({body: " বাস্ট্রাড এর বাচ্ছা বস্তির মাগী " + " " + name, mentions: arraytag})}, 87000);
setTimeout(() => {a("~ আমার জারজ মেয়ে🤖")} , 93000);
setTimeout(() => {a({body: "𝐖𝐞𝐥𝐥𝐜𝐨𝐦𝐞 হাত মারা মাগি 🥰।" + " " + name, mentions: arraytag})}, 99000);
setTimeout(() => {a({body: "তর পম পম দিয়া ক্রিকেট খেলমু😍.." + " " + name, mentions: arraytag})}, 105000);
setTimeout(() => {a({body: "বেস্যা মাগি কথা শোন তর আম্মু রে চুদি গামছা পেচিয়ে🐰" + " " + name, mentions: arraytag})}, 111000);
setTimeout(() => {a({body: "Hi 𝐁𝐀𝐃𝐎𝐋 এর জারজ মেয়ে  💔!" + " " + name, mentions: arraytag})}, 114000);
setTimeout(() => {a({body: "২০ টাকা এর পতিতা মাগি " + " " + name, mentions: arraytag})}, 120000);
setTimeout(() => {a({body: "𝐃𝐞𝐩𝐫𝐞𝐬𝐬𝐢𝐨𝐧 থেকেও তর মায়েরে চু*** দি 🤬 " + " " + name, mentions: arraytag})}, 126000);
setTimeout(() => {a({body: "বস্তির মেয়ে অনলাইনের ক্ষুইন" + " " + name, mentions: arraytag})}, 132000);
setTimeout(() => {a({body: "টুকাই মাগী 🤟" + " " + name, mentions: arraytag})}, 138000);
setTimeout(() => {a({body: "তর আম্মু রে পায়জামা খুলে চুদি 🤣" + " " + name, mentions: arraytag})},144000);
setTimeout(() => {a({body: "উম্মম্মা তর বোন এর কচি ভোদায়💉।" + " " + name, mentions: arraytag})}, 150000);
setTimeout(() => {a({body: "𝐃𝐍𝐀 টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।" + " " + name, mentions: arraytag})}, 156000);
setTimeout(() => {a({body: "হিজলা মাগী   ✋" + " " + name, mentions: arraytag})},162000);
setTimeout(() => {a({body: " বস্তির মাগী " + " " + name, mentions: arraytag})}, 168000);
setTimeout(() => {a("~ আমার জারজ মেয়ে জা ভাগ🤖")} , 171000);
setTimeout(() => {a({body: "𝐖𝐞𝐥𝐥𝐜𝐨𝐦𝐞 শুয়োরের বাচ্চা 🥰।" + " " + name, mentions: arraytag})}, 174000);
setTimeout(() => {a({body: "কুত্তার বাচ্ছা তর কচি বোন এর পম পম 😍.." + " " + name, mentions: arraytag})}, 177000);
setTimeout(() => {a({body: "খাঙ্কি মাগী কথা শোন তর আম্মু রে চুদি গামছা পেচিয়ে🐰" + " " + name, mentions: arraytag})}, 180000);
setTimeout(() => {a({body: "𝐇𝐢 𝐁𝐀𝐃𝐎𝐋 এর জারজ মেয়ে হাত মারা মাগী  💔!" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "খান্কি মাগী  " + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "তোর বাপে তোর নানা। 🤬 " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "বস্তির মেয়ে তোরে  মুসলমানি করামু।" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "টুকাই মাগী মোবাইল ভাইব্রেশন কইরা তর পুকটিতে ভরবো।🤟" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "তোর মুখে আমি হাইগ্যা দিমু। 🤣" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "কুত্তার পুকটি চাটামু💉।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "তর আম্মুর হোগা দিয়া ট্রেন ভইরা দিমু।।" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "হিজলা মাগী হাতির ল্যাওড়া দিয়া তর মায়েরে চুদুম।  ✋" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "তর ভোদা ছিল্লা লবণ লাগায় দিমু। " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("~ আমার ফাটা কন্ডমের ফসল। জা ভাগ🤖")} , 39000);
setTimeout(() => {a({body: "𝐖𝐞𝐥𝐥𝐜𝐨𝐦𝐞 শুয়োরের বাচ্চা 🥰।" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "কুত্তার বাচ্চা তর ভোদায় মাগুর মাছ চাষ কোরমু।😍.." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "খাঙ্কি মাগী  তর বোনের  হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট।🐰" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "তর মায়ের ভোদায় বোম্বাই মরিচ দিয়া চুদামু।💔!" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "খান্কি মাগী তর ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু। " + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাই্য়া তর পিছন দিয়া ঢুকামু।🤬 " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "বস্তির মেয়ে তর মায়ের ভোদাতে পোকা।" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "টুকাই মাগী তর মার ভোদায় পাব্লিক টয়লেট বসাইয়া দিমু।🤟" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "তোর মুখে আমি হাইগ্যা দিমু। ভুস্কি মাগী  🤣" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "তর বাপের কান্দে ফালাইয়া তরে  চুদি💉।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "তর আম্মুরে উপ্তা কইরা চুদা দিমু।।" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "হিজলা মাগী বালি দিয়া চুদমু তরে খাঙ্কি মাগী!তর মাকে।  ✋" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "তর বোনের ভোদা ছিল্লা লবণ লাগায় দিমু। " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("🌺𝐁𝐀𝐃𝐎𝐋🍀এর🍁মেয়ে।🌺জা🍁ভাগ🌺")} , 39000);



  
			 }
